# Project

### Importando as bibliotecas

In [1]:
import sys
sys.path.append('..')
import pandas as pd
import pyodbc
import params.consts as consts

### Conectando com o banco de dados

In [4]:
data_connection = ( # Armazenando em uma variável os dados de conexão com o banco de dados
    'Driver={SQL Server};' # Passando o nome do programa a ser utilizado
    'Server=GalaxyBook2-360;' # Passando o nome do servidor/usuário. Para descobrir, basta digitar no cmd hostname
    'Database=AdventureWorksDW2022;' # Passando o nome do banco de dados a ser consultado
)

connection = pyodbc.connect(data_connection) # Fazendo a conexão com o banco de dados

print('Conexão realizada com sucesso.') # Confirmando que a conexão foi realizada com sucesso

Conexão realizada com sucesso.

### Consultando o banco de dados

In [17]:
sql_code = ''' 
    SELECT TOP (100)
        fis.SalesOrderNumber AS 'order_number',
        fis.OrderDate AS 'order_date',
        dpc.EnglishProductCategoryName AS 'category',
        fis.CustomerKey AS 'customer_id',
        dc.FirstName + ' ' + dc.LastName AS 'name',
        REPLACE(REPLACE(dc.Gender, 'M','Male'), 'F', 'Female') AS 'gender',
        dg.EnglishCountryRegionName AS 'country',
        fis.OrderQuantity AS 'order_quantity',
        fis.SalesAmount AS 'sales_amount',
        fis.TotalProductCost AS 'total_product_cost',
        fis.SalesAmount - fis.TotalProductCost AS 'sales_profit'
    FROM
        FactInternetSales fis
    INNER JOIN DimProduct dp ON fis.ProductKey = dp.ProductKey
        INNER JOIN DimProductSubcategory dps ON dp.ProductSubcategoryKey = dps.ProductSubcategoryKey
            INNER JOIN DimProductCategory dpc ON dps.ProductCategoryKey = dpc.ProductCategoryKey
    INNER JOIN DimCustomer dc ON fis.CustomerKey = dc.CustomerKey
        INNER JOIN DimGeography dg ON dc.GeographyKey = dg.GeographyKey
    WHERE YEAR(fis.OrderDate) = 2013
''' # Escrevendo o código em SQL para consultar os dados

df = pd.read_sql(sql_code, connection) # Criando um dataset com os dados extraídos

C:\Users\mathe\AppData\Local\Temp\ipykernel_32604\3365471975.py:24: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql_code, connection) # Criando um dataset com os dados extraídos

### Visualizando o dataset

In [18]:
df.head() # Exibindo o início do dataset

,order_number,order_date,category,customer_id,name,gender,country,order_quantity,sales_amount,total_product_cost,sales_profit
0,SO51259,2013-01-01,Bikes,11433,Maurice Shan,Male,France,1,2384.07,1481.9379,902.1321
1,SO51259,2013-01-01,Accessories,11433,Maurice Shan,Male,France,1,8.99,3.3623,5.6277
2,SO51259,2013-01-01,Accessories,11433,Maurice Shan,Male,France,1,4.99,1.8663,3.1237
3,SO51259,2013-01-01,Accessories,11433,Maurice Shan,Male,France,1,34.99,13.0863,21.9037
4,SO51259,2013-01-01,Clothing,11433,Maurice Shan,Male,France,1,8.99,6.9223,2.0677

In [19]:
df.tail() # Exibindo o fim do dataset

,order_number,order_date,category,customer_id,name,gender,country,order_quantity,sales_amount,total_product_cost,sales_profit
95,SO51365,2013-01-08,Accessories,11156,Maria Roberts,Female,United States,1,54.99,20.5663,34.4237
96,SO51361,2013-01-08,Accessories,25795,Marie Gomez,Female,Germany,1,2.29,0.8565,1.4335
97,SO51361,2013-01-08,Accessories,25795,Marie Gomez,Female,Germany,1,3.99,1.4923,2.4977
98,SO51361,2013-01-08,Accessories,25795,Marie Gomez,Female,Germany,1,32.60,12.1924,20.4076
99,SO51361,2013-01-08,Bikes,25795,Marie Gomez,Female,Germany,1,2443.35,1554.9479,888.4021

### Salvando o dataset

In [21]:
df.to_csv(consts.DATASET, index=False) # Salvando o dataset em formato csv

In [22]:
from sqlalchemy import create_engine

In [23]:
engine = create_engine('mssql+pyodbc://GalaxyBook2-360/AdventureWorksDW2022?driver=SQL+Server')

In [24]:
df = pd.read_sql(sql_code, engine) # Criando um dataset com os dados extraídos

In [25]:
df.head() # Exibindo o início do dataset

,order_number,order_date,category,customer_id,name,gender,country,order_quantity,sales_amount,total_product_cost,sales_profit
0,SO51259,2013-01-01,Bikes,11433,Maurice Shan,Male,France,1,2384.07,1481.9379,902.1321
1,SO51259,2013-01-01,Accessories,11433,Maurice Shan,Male,France,1,8.99,3.3623,5.6277
2,SO51259,2013-01-01,Accessories,11433,Maurice Shan,Male,France,1,4.99,1.8663,3.1237
3,SO51259,2013-01-01,Accessories,11433,Maurice Shan,Male,France,1,34.99,13.0863,21.9037
4,SO51259,2013-01-01,Clothing,11433,Maurice Shan,Male,France,1,8.99,6.9223,2.0677

In [26]:
df.tail() # Exibindo o fim do dataset

,order_number,order_date,category,customer_id,name,gender,country,order_quantity,sales_amount,total_product_cost,sales_profit
95,SO51365,2013-01-08,Accessories,11156,Maria Roberts,Female,United States,1,54.99,20.5663,34.4237
96,SO51356,2013-01-07,Accessories,19393,Miguel Anderson,Male,United States,1,8.99,3.3623,5.6277
97,SO51356,2013-01-07,Bikes,19393,Miguel Anderson,Male,United States,1,1120.49,713.0798,407.4102
98,SO51355,2013-01-07,Accessories,22260,Courtney Allen,Female,United States,1,2.29,0.8565,1.4335
99,SO51355,2013-01-07,Accessories,22260,Courtney Allen,Female,United States,1,21.49,8.0373,13.4527